Tekla Open API Reference for Tekla Structures 2025
PointList.Insert Method
 Inserts the point to the specified index.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public void Insert(
	int index,
	Point value
)
Public Sub Insert (
	index As Integer,
	value As Point
)
Parameters
index
Type: System.Int32
The index where the point is inserted.
value
Type: Tekla.Structures.Geometry3d.Point
The point to be inserted.
See Also
Reference
PointList Class
Tekla.Structures.Drawing Namespace